antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
RTC_NOINIT_ATTR static CrashLog crash_log;

static const char *reset_reason_str(uint8_t r)
{
  switch (r)
  {
    case ESP_RST_SW:         return "SW";
    case ESP_RST_PANIC:      return "PANIC";
    case ESP_RST_INT_WDT:    return "IWDT";
    case ESP_RST_TASK_WDT:   return "TWDT";
    case ESP_RST_WDT:        return "WDT";
    case ESP_RST_BROWNOUT:   return "BROWN";
    case ESP_RST_EFUSE:      return "EFUSE";
    case ESP_RST_PWR_GLITCH: return "GLITCH";
    case ESP_RST_CPU_LOCKUP: return "LOCKUP";
    default:                 return "RST";
  }
}

// Copy PC + task name out of a flash coredump into crash_log, then erase the
// dump so a stale one is never re-harvested after a later dump-less reset
// (e.g. RTC WDT, where the panic handler never ran).
static void harvest_coredump_summary()
{
  crash_log.pc = 0;
  crash_log.task[0] = '\0';
  crash_log.elf_sha[0] = '\0';
#ifdef CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH
  esp_core_dump_summary_t *sum =
      (esp_core_dump_summary_t *)calloc(1, sizeof(*sum));
  if (sum == NULL)
    return;
  if (esp_core_dump_get_summary(sum) == ESP_OK)
  {
    crash_log.pc = sum->exc_pc;
    memcpy(crash_log.task, sum->exc_task, sizeof(crash_log.task));
    crash_log.task[sizeof(crash_log.task) - 1] = '\0';
    // Already a hex string in the summary; keep the first 8 chars
    size_t sha_n = strnlen((const char *)sum->app_elf_sha256,
                           sizeof(crash_log.elf_sha) - 1);
    memcpy(crash_log.elf_sha, sum->app_elf_sha256, sha_n);
    crash_log.elf_sha[sha_n] = '\0';
    esp_core_dump_image_erase();
  }
  free(sum);
#endif
}

// Detect and record an abnormal reset. Must run before RTC state is used in
// anger, but after setup_serial() so the LOGI is visible.
static void crash_forensics_on_boot()
{
  esp_reset_reason_t rr = esp_reset_reason();
  if (crash_log.magic != CRASH_LOG_MAGIC)
  {
    // True power-on (or first firmware with CrashLog): noinit RAM is garbage
    memset(&crash_log, 0, sizeof(crash_log));
    crash_log.magic = CRASH_LOG_MAGIC;
  }
  else if (rr != ESP_RST_DEEPSLEEP && rr != ESP_RST_POWERON &&
           rr != ESP_RST_USB && rr != ESP_RST_JTAG && rr != ESP_RST_SDIO)
  {
    // USB/JTAG/SDIO excluded: flash-tool resets, not field crashes
    if (crash_log.crash_count < 255)
      crash_log.crash_count++;
    crash_log.last_reason     = (uint8_t)rr;
    crash_log.last_stage      = crash_log.stage;
    crash_log.last_boot_count = crash_log.cur_boot_count;
    crash_log.last_time       = crash_log.cur_time;
    harvest_coredump_summary();
    LOGI("Abnormal reset #%u: %s at boot %d stage %d pc 0x%x %s",
         (unsigned)crash_log.crash_count, reset_reason_str(crash_log.last_reason),
         (int)crash_log.last_boot_count, (int)crash_log.last_stage,
         (unsigned)crash_log.pc, crash_log.task);
  }
  crash_log.stage = STAGE_BOOT;
}

RTC_DATA_ATTR time_t first_boot_time = 0;
RTC_DATA_ATTR time_t next_clear_time = 0;
const time_t one_day = 86400;

RTC_DATA_ATTR float previous_temp = TEMP_NO_PREVIOUS;
RTC_DATA_ATTR int previous_boot_count = -1;

RTC_DATA_ATTR uint32_t max_battery_mv = 0;

RTC_DATA_ATTR uint32_t bad_pin27_count = 0;

// Min/max temperature since boot
RTC_DATA_ATTR float min_temp_since_boot = TEMP_INIT_MIN;
RTC_DATA_ATTR float max_temp_since_boot = TEMP_INIT_MAX;

// Bootstrap budget for the very first sync (see ntp_bootstrap_sync).
#define NTP_BOOTSTRAP_ASSOC_TRIES     3
#define NTP_BOOTSTRAP_SNTP_TRIES      3
#define NTP_BOOTSTRAP_SNTP_TIMEOUT_MS 10000U
// Wakes between bootstrap retries, doubling to 8x this on repeated failure.
#define NTP_BOOTSTRAP_FIRST_WAKES     8

// Minimum resync interval (1 day) — floor to avoid hammering WiFi
#define RESYNC_INTERVAL_MIN  (86400)
// Maximum resync interval (4 weeks)
#define RESYNC_INTERVAL_MAX  (28 * 86400)

// Periodic NTP resync state
RTC_DATA_ATTR time_t next_resync_time = 0;           // when to next attempt NTP resync
// Starts at the floor: the first resync is the only measurement the device has
// for a fortnight otherwise, and a healthy clock climbs back out fast (each
// negligible-drift resync doubles the interval, so 1d → 28d in five wakes).
RTC_DATA_ATTR int32_t resync_interval_s = RESYNC_INTERVAL_MIN;
RTC_DATA_ATTR int32_t last_drift_ms = 0;             // drift measured at last resync (positive = clock ahead)
RTC_DATA_ATTR int32_t last_drift_window_s = 0;       // measured span the drift accumulated over (NOT the interval setting: failed attempts stretch it)
RTC_DATA_ATTR time_t last_sync_time = 0;             // wall-clock of last successful NTP sync (0 = never)
RTC_DATA_ATTR uint16_t resync_fail_count = 0;        // failed resync attempts since the last success
// Rate history, newest last. One measurement says how far the clock ran off;
// several say whether the RC oscillator's error is a stable constant (which is
// what drift compensation would need) or wanders with temperature.
RTC_DATA_ATTR int16_t drift_ppm_hist[DRIFT_PPM_HIST_SIZE] = {};
RTC_DATA_ATTR uint16_t drift_win_min[DRIFT_PPM_HIST_SIZE] = {};  // window per rate, for weighting
RTC_DATA_ATTR uint8_t drift_ppm_count = 0;

// Status flags for display error indicators
RTC_DATA_ATTR bool wifi_ok = false;
RTC_DATA_ATTR bool ntp_synced = false;
RTC_DATA_ATTR bool last_sensor_ok = true;

// Gather/scatter the drift block for the flash archive. Keeping it in one place
// means the on-flash layout (HistoryDriftState) and these RTC variables can
// only drift apart in one file.
static void drift_state_save(HistoryDriftState *d)
{
  d->resync_interval_s = resync_interval_s;
  d->last_drift_ms = last_drift_ms;
  d->last_drift_window_s = last_drift_window_s;
  d->last_sync_time = (int64_t)last_sync_time;
  d->resync_fail_count = resync_fail_count;
  d->drift_ppm_count = drift_ppm_count;
  d->rsvd = 0;
  memcpy(d->drift_ppm_hist, drift_ppm_hist, sizeof(drift_ppm_hist));
  memcpy(d->drift_win_min, drift_win_min, sizeof(drift_win_min));
}

// `trust_clock` gates only last_sync_time: it is the reference maybe_ntp_resync()
// measures the next drift window against, so restoring it under a clock that
// has not been set yet would produce a nonsense window on the first resync
// after a power-cycle. The rates themselves are timeless and always restored.
static void drift_state_load(const HistoryDriftState *d, bool trust_clock)
{
  resync_interval_s = d->resync_interval_s;
  last_drift_ms = d->last_drift_ms;
  last_drift_window_s = d->last_drift_window_s;
  resync_fail_count = d->resync_fail_count;
  drift_ppm_count = d->drift_ppm_count;
  if (drift_ppm_count > DRIFT_PPM_HIST_SIZE)
    drift_ppm_count = DRIFT_PPM_HIST_SIZE;
  memcpy(drift_ppm_hist, d->drift_ppm_hist, sizeof(drift_ppm_hist));
  memcpy(drift_win_min, d->drift_win_min, sizeof(drift_win_min));
  if (trust_clock)
    last_sync_time = (time_t)d->last_sync_time;
}

// Longest gap still attributed to a missed safety-net wake rather than to the
// device being off. The safety net fires hourly, so this allows exactly one
// miss; beyond it, skipped hours are marked HOURLY_NO_DATA instead of repeating
// the last reading.
#define HOURLY_REPEAT_FILL_MAX 2

// Write one finalized entry into the ring and mirror it to the flash archive.
// Every ring write goes through here so the two can never diverge.
static void hourly_append(time_t hour_start, const HourlyEntry &entry)
{
  historical_data.hourly[historical_data.hourly_idx] = entry;
  historical_data.hourly_idx = (historical_data.hourly_idx + 1) % HOURLY_HISTORY_SIZE;
  if (historical_data.hourly_count < HOURLY_HISTORY_SIZE)
    historical_data.hourly_count++;
  history_store_append_hourly(hour_start, &entry);
}

// Update the hourly history buffer with a new temperature reading.
// Called on every main CPU wake (both delta-triggered and safety-net timer).
// When the clock hour changes, the accumulated entry is finalized and appended
// to the circular buffer. Any skipped hours (shouldn't happen normally since
// the safety net wakes every hour) are filled with sentinel entries.
static void update_hourly_history(time_t now, const struct tm *nowtm, float temp)
{
  // Nothing here is meaningful without a wall clock: entries are filed by clock
  // hour, and a 1970 timestamp would file them ~54 years before everything
  // already stored. Recording nothing (and letting the `! NOSYNC` badge explain
  // the stall) beats recording lies — before this guard an unsynced device
  // wrote 1970-stamped entries, and the eventual forward step filled the whole
  // ring with one repeated value.
  if (!time_is_plausible(now))
    return;

  int16_t temp_x10 = (int16_t)(temp * 10);

  // Compute wall-clock start-of-hour for current local time
  struct tm hour_tm = *nowtm;
  hour_tm.tm_min = 0;
  hour_tm.tm_sec = 0;
  time_t hour_start = mktime(&hour_tm);

  // Finalize only when the clock has moved into a genuinely later hour than
  // anything already stored. An NTP resync correcting a slow RTC steps the
  // clock BACKWARDS (−9559s on the ESP32-E, docs/clock-drift.md): the negative
  // hours_elapsed below already skips the fill, but a plain "hour changed"
  // test would still advance hourly_idx while moving hourly_latest_time
  // backwards, permanently offsetting the index→time mapping in Display.h that
  // every later entry inherits. Re-lived hours therefore keep accumulating
  // into the current entry and produce exactly one entry once the clock passes
  // the newest stored hour again — no duplicate, no gap.
  bool hour_advanced = historical_data.current_hour_start != 0 &&
                       hour_start > historical_data.current_hour_start;
  bool extends_history = (hour_start - 3600) > historical_data.hourly_latest_time;
  if (hour_advanced && extends_history)
  {
    // Clock hour changed — finalize the completed hour's entry
    HourlyEntry entry;
    entry.min_x10 = historical_data.current_hour_min_x10;
    entry.max_x10 = historical_data.current_hour_max_x10;
    entry.avg_x10 = (historical_data.current_hour_sample_count > 0)
      ? (int16_t)(historical_data.current_hour_sum_x10 / historical_data.current_hour_sample_count)
      : historical_data.current_hour_min_x10;

    hourly_append(historical_data.current_hour_start, entry);

    // Fill any skipped hours.
    // Uses time_t difference (UTC-based) so DST transitions are handled
    // correctly — a "spring forward" skip produces one fill, a "fall back"
    // repeat produces hours_elapsed=0 (no fill needed).
    int hours_elapsed = (int)((hour_start - historical_data.current_hour_start) / 3600);
    if (hours_elapsed > HOURLY_HISTORY_SIZE)
      hours_elapsed = HOURLY_HISTORY_SIZE;

    // A short gap means the ULP safety-net woke but no delta was detected, so
    // temperature was stable and the last known value is the best estimate. A
    // long one means the device was not running at all — a battery swap, a
    // reflash, or a restore from flash — and repeating the last value there
    // would draw a flat line across days the device never measured. The safety
    // net fires hourly, so anything past one missed wake is the second case.
    HourlyEntry gap = entry;
    if (hours_elapsed > HOURLY_REPEAT_FILL_MAX)
      gap.min_x10 = gap.max_x10 = gap.avg_x10 = HOURLY_NO_DATA;

    for (int i = 1; i < hours_elapsed; i++)
      hourly_append(historical_data.current_hour_start + (time_t)i * 3600, gap);

    // Update reference time: the last written entry's start-of-hour
    historical_data.hourly_latest_time = hour_start - 3600;

    // Reset accumulator for the new hour
    historical_data.current_hour_sum_x10 = 0;
    historical_data.current_hour_sample_count = 0;
    historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
    historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  }

  // First reading after boot — initialize reference time. It names the newest
  // *finalized* entry and there are none yet, so it sits one hour before the
  // in-progress hour; the first finalize then lands on the boot hour and
  // extends_history above is satisfied.
  if (historical_data.current_hour_start == 0)
    historical_data.hourly_latest_time = hour_start - 3600;

  historical_data.current_hour_start = hour_start;

  // Accumulate reading into current hour's stats
  historical_data.current_hour_sample_count++;
  historical_data.current_hour_sum_x10 += temp_x10;
  if (temp_x10 < historical_data.current_hour_min_x10)
    historical_data.current_hour_min_x10 = temp_x10;
  if (temp_x10 > historical_data.current_hour_max_x10)
    historical_data.current_hour_max_x10 = temp_x10;
}

static void update_temp_extremes(float temp)
{
  if (temp < min_temp_since_boot)
    min_temp_since_boot = temp;
  if (temp > max_temp_since_boot)
    max_temp_since_boot = temp;
}

