antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
// Radio fully off before deep sleep (matches former WiFi.disconnect(true, true)).
// Handlers unregister before deinit and the stopping flag stays set throughout,
// so a late STA_DISCONNECTED can't call esp_wifi_connect() on a dead driver.
static void wifi_disconnect()
{
  s_wifi_stopping = true;
  esp_wifi_stop();
  if (s_wifi_handler)
  {
    esp_event_handler_instance_unregister(WIFI_EVENT, ESP_EVENT_ANY_ID, s_wifi_handler);
    s_wifi_handler = nullptr;
  }
  if (s_ip_handler)
  {
    esp_event_handler_instance_unregister(IP_EVENT, IP_EVENT_STA_GOT_IP, s_ip_handler);
    s_ip_handler = nullptr;
  }
  esp_wifi_deinit();
  s_wifi_stopping = false;
}

static bool wifi_connect()
{
  esp_err_t err = nvs_flash_init(); // esp_wifi_init() requires NVS
  if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND)
  {
    nvs_flash_erase();
    err = nvs_flash_init();
  }
  if (err != ESP_OK)
  {
    LOGI("NVS init failed: 0x%x", err);
    return false;
  }

  // Degrade to "NO WIFI" on any init failure (the Arduino path never aborted);
  // a panic here would boot-loop a battery device instead of rendering a frame.
#define WIFI_TRY(x)                                        \
  do {                                                     \
    esp_err_t _e = (x);                                    \
    if (_e != ESP_OK)                                      \
    {                                                      \
      LOGI("WiFi setup failed (%s): " #x, esp_err_to_name(_e)); \
      wifi_disconnect();                                   \
      return false;                                        \
    }                                                      \
  } while (0)

  WIFI_TRY(esp_netif_init());
  err = esp_event_loop_create_default();
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) // INVALID_STATE = already created
  {
    LOGI("Event loop creation failed: 0x%x", err);
    return false;
  }
  static esp_netif_t *sta_netif = nullptr;
  if (!sta_netif)
    sta_netif = esp_netif_create_default_wifi_sta();
  if (!sta_netif)
  {
    LOGI("WiFi setup failed: no STA netif");
    return false;
  }

  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  WIFI_TRY(esp_wifi_init(&cfg));

  if (!s_wifi_events)
    s_wifi_events = xEventGroupCreate();
  xEventGroupClearBits(s_wifi_events, WIFI_CONNECTED_BIT);
  WIFI_TRY(esp_event_handler_instance_register(WIFI_EVENT, ESP_EVENT_ANY_ID,
                                               &wifi_event_handler, nullptr, &s_wifi_handler));
  WIFI_TRY(esp_event_handler_instance_register(IP_EVENT, IP_EVENT_STA_GOT_IP,
                                               &wifi_event_handler, nullptr, &s_ip_handler));

  wifi_config_t wcfg = {};
  strncpy((char *)wcfg.sta.ssid, MY_WIFI_SSID, sizeof(wcfg.sta.ssid) - 1);
  strncpy((char *)wcfg.sta.password, MY_WIFI_PASSWORD, sizeof(wcfg.sta.password) - 1);
  WIFI_TRY(esp_wifi_set_storage(WIFI_STORAGE_RAM)); // reconfigured every boot; skip NVS writes
  WIFI_TRY(esp_wifi_set_mode(WIFI_MODE_STA));
  WIFI_TRY(esp_wifi_set_config(WIFI_IF_STA, &wcfg));
  WIFI_TRY(esp_wifi_start());
#undef WIFI_TRY

  LOGI("Waiting for WiFi");
  EventBits_t bits = xEventGroupWaitBits(s_wifi_events, WIFI_CONNECTED_BIT,
                                         pdFALSE, pdFALSE, pdMS_TO_TICKS(WIFI_TIMEOUT_MS));
  if (!(bits & WIFI_CONNECTED_BIT))
  {
    LOGI("WiFi connection timed out after %u ms", (unsigned)WIFI_TIMEOUT_MS);
    wifi_disconnect();
    return false;
  }
  return true;
}

// One-shot SNTP sync: fresh instance, wait for a genuinely new time response.
static bool sntp_sync_once(uint32_t timeout_ms)
{
  esp_sntp_config_t scfg = {};
  scfg.start = true;
  scfg.wait_for_sync = true;
  scfg.num_of_servers = 1;
  scfg.servers[0] = "pool.ntp.org";
#if CONFIG_LWIP_SNTP_MAX_SERVERS >= 2
  scfg.num_of_servers = 2;
  scfg.servers[1] = "time.google.com";
#endif
  if (esp_netif_sntp_init(&scfg) != ESP_OK)
    return false;
  bool ok = (esp_netif_sntp_sync_wait(pdMS_TO_TICKS(timeout_ms)) == ESP_OK);
  esp_netif_sntp_deinit();
  return ok;
}

// Bring the clock up when it has never been set, retrying inside a single WiFi
// session.
//
// The two failure modes cost very differently, so they get different budgets.
// A failed association is ~15s of radio (~1.5C); a failed SNTP with the
// association already up is just more waiting on a radio that is already
// powered, and it is the mode most likely to clear on a second ask. So retry
// SNTP hard and association gently.
//
// Worth real energy because the alternative is worse than a slow clock: with no
// wall clock the device records nothing at all (see update_hourly_history), so
// a permanently unsynced device collects nothing.
static bool ntp_bootstrap_sync(void)
{
  for (int assoc = 0; assoc < NTP_BOOTSTRAP_ASSOC_TRIES; assoc++)
  {
    if (!wifi_connect())
    {
      LOGI("NTP bootstrap: WiFi attempt %d/%d failed", assoc + 1,
           NTP_BOOTSTRAP_ASSOC_TRIES);
      continue;
    }
    LOGI("Connected to WiFi");
    wifi_ok = true;
    for (int s = 0; s < NTP_BOOTSTRAP_SNTP_TRIES; s++)
    {
      if (sntp_sync_once(NTP_BOOTSTRAP_SNTP_TIMEOUT_MS))
      {
        wifi_disconnect();
        LOGI("WiFi disconnected");
        return true;
      }
      LOGI("NTP bootstrap: SNTP attempt %d/%d timed out (association held)",
           s + 1, NTP_BOOTSTRAP_SNTP_TRIES);
    }
    wifi_disconnect();
    LOGI("WiFi disconnected");
    return false;  // network is up but NTP isn't; re-associating won't help
  }
  return false;
}

// Is a bootstrap retry due on this wake?
//
// Counted in wakes, not wall time: next_resync_time arithmetic is useless when
// the clock is the broken thing (with now ~ 0, now + resync_interval_s lands a
// simulated day away). Escalates from one attempt per 8 wakes to one per 64,
// which at the observed rate (~48 refresh wakes + 24 safety-net wakes/day)
// settles near one attempt per day — the same order the device already accepts
// for a failing resync, and far off the ~36-108C/day that retrying on every
// safety-net wake would cost.
static bool ntp_bootstrap_due(void)
{
  uint32_t shift = resync_fail_count < 3 ? resync_fail_count : 3;
  uint32_t period = (uint32_t)NTP_BOOTSTRAP_FIRST_WAKES << shift;
  return boot_count > 0 && ((uint32_t)boot_count % period) == 0;
}

// Attempt NTP resync if due. Measures clock drift and adjusts next interval.
static void maybe_ntp_resync(time_t now)
{
  if (!ntp_synced)
  {
    // The clock was never set — on_first_boot() ran once and failed. Without
    // this the device stayed on a 1970 clock until someone reset it, because
    // on_first_boot() only runs at boot_count == 1.
    if (!ntp_bootstrap_due())
      return;
    LOGI("NTP bootstrap: retrying first sync (%u failures so far)",
         (unsigned)resync_fail_count);
    if (!ntp_bootstrap_sync())
    {
      resync_fail_count++;
      return;
    }
    time(&last_sync_time);
    ntp_synced = true;
    resync_fail_count = 0;
    if (first_boot_time == 0)
      first_boot_time = last_sync_time;
    next_resync_time = last_sync_time + resync_interval_s;
    LOGI("NTP bootstrap: clock set, resuming normal resyncs");
    // No drift to measure: the clock was wrong by an unknown amount, not
    // drifting from a known reference.
    return;
  }
  if (next_resync_time == 0)
  {
    // First call after boot — schedule initial resync
    next_resync_time = now + resync_interval_s;
    return;
  }
  if (now < next_resync_time)
    return;

  LOGI("NTP resync: connecting to WiFi");
  if (!wifi_connect())
  {
    resync_fail_count++;
    LOGI("NTP resync: WiFi failed (%u in a row), deferring to next scheduled resync",
         (unsigned)resync_fail_count);
    next_resync_time = now + resync_interval_s;
    return;
  }

