antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  setup_serial();
  crash_forensics_on_boot();

#if defined(HAS_ULP_SUPPORT) && defined(SOC_ULP_FSM_SUPPORTED)
  ulp_check_data_overlap();  // abort immediately if ULP data overlaps RTC variables
#endif

#ifdef PPK2_DEBUG
  gpio_out_init(PPK2_PIN_CPU_ACTIVE);
  gpio_out_init(PPK2_PIN_DISPLAY);
#endif
  PPK2_CPU_ACTIVE_HIGH();

  // Detect stale RTC memory from a different firmware version.
  // Three checks: version tag mismatch (format changed), address shift
  // (linker moved the struct due to other RTC variable changes), and
  // state version mismatch (non-history RTC variables changed).
  if (historical_data.version != RTC_HISTORY_VERSION ||
      historical_data.self_addr != (uint32_t)&historical_data)
  {
    if (historical_data.version != RTC_HISTORY_VERSION)
      LOGI("RTC history version mismatch — resetting history");
    else
      LOGI("RTC history address shifted (was 0x%08x, now 0x%08x) — resetting history",
           (unsigned)historical_data.self_addr, (unsigned)(uint32_t)&historical_data);
    reset_rtc_history();
    reset_rtc_state();
    restore_history_from_flash();  // must run last: reset_rtc_state() would
                                   // otherwise clobber the restored drift block
  }
  else if (rtc_state_version != RTC_STATE_VERSION)
  {
    LOGI("RTC state version mismatch — resetting state (history preserved)");
    reset_rtc_state();
    restore_drift_from_flash();  // history survived; the drift block did not
  }

  boot_count++;
  crash_log.cur_boot_count = boot_count;
  // CPU frequency is fixed at 80 MHz at build time (CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ)
  // — replaces the Arduino-era setCpuFrequencyMhz(80) on non-first boots.

  LOGI("Boot count: %d [%s] sizeof(TempReading)=%d sizeof(time_t)=%d",
       boot_count, GIT_HASH, (int)sizeof(TempReading), (int)sizeof(time_t));

  // Diagnostic: dump sparkline buffer to detect packed struct corruption
  if (historical_data.temp_count > 0)
  {
    LOGI("Sparkline: count=%d", historical_data.temp_count);
    for (int i = 0; i < historical_data.temp_count; i++)
    {
      LOGI("  [%d] ts=%lld temp_x10=%d",
           i,
           (long long)historical_data.temp[i].timestamp,
           (int)historical_data.temp[i].temp_x10);
    }
  }

  esp_sleep_wakeup_cause_t wakeup_cause = s_wake_cause;
  LOGI("Wakeup caused by %d (raw 0x%x)", (int)wakeup_cause, (unsigned)s_wake_causes_raw);

  uint32_t battery_mv = read_battery_level();

  handle_permanent_shutdown(battery_mv);

  if ((wakeup_cause == ESP_SLEEP_WAKEUP_ULP || wakeup_cause == ESP_SLEEP_WAKEUP_TIMER)
      && sensor.SupportsUlp())
  {
    float temp;
    crash_log.stage = STAGE_ULP_READ;
    if (sensor.ReadUlpTemperature(&temp, previous_temp))
    {
      last_sensor_ok = true;
      refresh_and_sleep(battery_mv, temp);
      return; // never reached
    }
    // ULP I2C error — fall through to normal sensor read
    last_sensor_ok = false;
  }

  if (boot_count == 1)
  {
    initialize_status_led();
    on_first_boot();
    clear_status_led(); // TODO: double check that this stops drawing power
  }

#ifdef MOCK_DISPLAY_DATA
  // Fill mock data if history is empty (handles both first boot and stale RTC
  // memory after firmware upload without power-cycle)
  if (historical_data.temp_count == 0)
  {
    time_t mock_now;
    struct tm mock_nowtm;
    get_time(&mock_now, &mock_nowtm);
    fill_mock_data(mock_now);
    // Force display refresh by invalidating previous_temp
    previous_temp = TEMP_NO_PREVIOUS;
  }
#endif

  crash_log.stage = STAGE_SENSOR;
  float temp = read_temperature();
  refresh_and_sleep(battery_mv, temp);
}

extern "C" void app_main(void)
{
  setup(); // deep-sleeps at the end; never returns
}
